### ACESSING COLUMNS IN A DATAFRAME

You can access the dataframes column by using Bracket or Column.

Also you can select multiple Columns to get a Dataframe.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("oil.csv")
df

            date  dcoilwtico
0     2013-01-01         NaN
1     2013-01-02       93.14
2     2013-01-03       92.97
3     2013-01-04       93.12
4     2013-01-07       93.20
...          ...         ...
1213  2017-08-25       47.65
1214  2017-08-28       46.40
1215  2017-08-29       46.46
1216  2017-08-30       45.96
1217  2017-08-31       47.26

[1218 rows x 2 columns]

In [18]:
column = df["dcoilwtico"]
type(column)
column

print(column.mean())
#print(column.unique())
print("Number of Missing Data :--",column.isna().sum())
print("Top 5 Values :--", column.value_counts().iloc[:5])

67.71436595744689
Number of Missing Data :-- 43
Top 5 Values :-- 60.01    4
46.02    4
47.65    4
93.12    4
47.72    4
Name: dcoilwtico, dtype: int64

In [11]:
## or
column_dot_method = df.dcoilwtico
print(type(column_dot_method))
column_dot_method

<class 'pandas.core.series.Series'>

0         NaN
1       93.14
2       92.97
3       93.12
4       93.20
        ...
1213    47.65
1214    46.40
1215    46.46
1216    45.96
1217    47.26
Name: dcoilwtico, Length: 1218, dtype: float64

In [21]:
multiple_columns = df[["date", "dcoilwtico"]]
type(multiple_columns)
multiple_columns.head()

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

### ACCESSING DATA WITH ILOC

+ The iloc accessor access data by their row and columns indices.
+ `df.iloc[row selection, column selection]`

In [28]:
df = pd.read_csv("transactions.csv")
df.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [30]:
df.iloc[1:4,:]

         date  store_nbr  transactions
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487

### ACCESSING DATA WITH LOC

+ Access the data using the row label and column label.
+ `df.loc[row number, column name]`

In [34]:
df.loc[1:100, "transactions"]

1      2111
2      2358
3      3487
4      1922
5      1903
       ...
96     1596
97     1642
98     1679
99     1513
100    2962
Name: transactions, Length: 100, dtype: int64